tests/cities.yml
---
execution:
  scenario: simple
  concurrency: 20
  hold-for: 1m

scenarios:
  simple:
   requests:
      - url: http://localhost/SimpleTravel/index.php
        method: GET
        label: Home Page

reporting:
  - module: blazemeter

modules:
  blazemeter:
    browser-open: none
    test: Simple Travel Build Test