tests/cities.yml
---
execution:
  scenario: simple
  concurrency: 20
  hold-for: 1m

scenarios:
scenarios:
  simple:
    requests:
      - url: http://blazedemo.com/index.php
        method: GET
        label: Home Page
      - url: http://blazedemo.com/reserve.php
        method: POST
        label: Choose Cities
        body:
          toPort: London
          fromPort: Boston

reporting:
  - module: blazemeter

modules:
  blazemeter:
    browser-open: none
    test: Simple Travel Build Test