tests/cities.yml
---
execution:
  scenario: simple
  concurrency: 50
  hold-for: 3m

scenarios:
  simple:
    requests:
      - url: 'http://localhost/SimpleTravel/index.php'
        method: GET
        label: Home Page
      - url: 'http://localhost/SimpleTravel/chooseFlights.php'
        method: POST
        label: Choose Flights
        body:
          fromPort: Paris
          toPort: Rome