tests/simpletravel_test.yml
---
execution:
- concurrency: 1
  hold-for: 60s
  iterations: 3
  ramp-up: 60s
  scenario: Thread Group
scenarios:
  Thread Group:
    data-sources:
    - delimiter: ','
      path: simpletravel_test.csv
      quoted: false
      recycle: false
    requests:
    - extract-regexp:
        token: <input type="hidden" name="csrf_token" value="(.+)" />
      headers:
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8
        Accept-Encoding: gzip,deflate,sdch
        Accept-Language: en-US,en;q=0.8
        Upgrade-Insecure-Requests: '1'
        User-Agent: Mozilla/5.0(X11;Linuxx86_64)AppleWebKit/537.36(KHTML,likeGecko)Chrome/50.0.2661.94Safari/537.36
      label: http://uut/SimpleTravel/
      method: GET
      url: http://uut/SimpleTravel/
    - body:
        csrf_token: ${token}
        fromPort: ${from}
        toPort: ${to}
      headers:
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8
        Accept-Encoding: gzip,deflate
        Accept-Language: en-US,en;q=0.8
        Content-Type: application/x-www-form-urlencoded
        Origin: http://uut
        Referer: http://uut/SimpleTravel/
        Upgrade-Insecure-Requests: '1'
        User-Agent: Mozilla/5.0(X11;Linuxx86_64)AppleWebKit/537.36(KHTML,likeGecko)Chrome/50.0.2661.94Safari/537.36
      label: http://uut/SimpleTravel/chooseFlights.php
      method: POST
      url: http://uut/SimpleTravel/chooseFlights.php
    - body:
        airline: VirginAmerica
        csrf_token: ${token}
        flight: '43'
        price: '472.56'
      headers:
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8
        Accept-Encoding: gzip,deflate
        Accept-Language: en-US,en;q=0.8
        Content-Type: application/x-www-form-urlencoded
        Origin: http://uut
        Referer: http://uut/SimpleTravel/chooseFlights.php
        Upgrade-Insecure-Requests: '1'
        User-Agent: Mozilla/5.0(X11;Linuxx86_64)AppleWebKit/537.36(KHTML,likeGecko)Chrome/50.0.2661.94Safari/537.36
      label: http://uut/SimpleTravel/purchaseFlight.php
      method: POST
      url: http://uut/SimpleTravel/purchaseFlight.php
    - body:
        address: 123Main
        city: Anytown
        csrf_token: ${token}
        name: Joe
        state: NY
        zip: '12345'
      headers:
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8
        Accept-Encoding: gzip,deflate
        Accept-Language: en-US,en;q=0.8
        Content-Type: application/x-www-form-urlencoded
        Origin: http://uut
        Referer: http://uut/SimpleTravel/purchaseFlight.php
        Upgrade-Insecure-Requests: '1'
        User-Agent: Mozilla/5.0(X11;Linuxx86_64)AppleWebKit/537.36(KHTML,likeGecko)Chrome/50.0.2661.94Safari/537.36
      label: http://uut/SimpleTravel/confirmPurchase.php
      method: POST
      url: http://uut/SimpleTravel/confirmPurchase.php
    store-cache: true
    store-cookie: true
    use-dns-cache-mgr: false